[
  {
    "id": "vindaloo037",
    "name": "Pork Vindaloo",
    "image": "/images/vindaloo.jpg",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 kg pork, cut into cubes",
      "1/2 cup vinegar",
      "2 tbsp ginger-garlic paste",
      "1 tbsp cumin powder",
      "1 tbsp coriander powder",
      "1 tsp turmeric powder",
      "1 tsp red chili powder",
      "4-5 cloves",
      "2-3 cinnamon sticks",
      "4-5 green cardamom pods",
      "1 black cardamom pod",
      "1 tsp black peppercorns",
      "1 large onion, finely chopped",
      "2 tomatoes, pureed",
      "2 tbsp oil",
      "Salt to taste"
    ],
    "stateId": "goa",
    "procedure": [
      "Marinate pork with vinegar, ginger-garlic paste, cumin powder, coriander powder, turmeric powder, red chili powder, cloves, cinnamon sticks, green cardamom, black cardamom, black peppercorns, and salt for at least 2 hours, or preferably overnight.",
      "Heat oil in a heavy-bottomed pan or pressure cooker.",
      "Add chopped onion and sauté until golden brown.",
      "Add the marinated pork and sear on all sides until browned.",
      "Add tomato puree and cook until the oil separates.",
      "Add 1 cup of water, bring to a boil, then reduce heat and simmer until pork is tender (about 45-60 minutes in a pan, 20-25 minutes in a pressure cooker after the first whistle).",
      "Adjust seasoning and serve hot with rice or bread."
    ]
  },
  {
    "id": "thekua033",
    "name": "Thekua",
    "image": "/images/thekua.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": true,
    "isSpicy": false,
    "ingredients": [
      "2 cups wheat flour",
      "1 cup jaggery, grated or powdered",
      "1/2 cup ghee, melted",
      "1/4 cup water (or as needed)",
      "1/2 tsp fennel seeds",
      "Oil for deep frying"
    ],
    "stateId": "jharkhand",
    "procedure": [
      "In a bowl, dissolve jaggery in water. Strain to remove impurities if any.",
      "In a large mixing bowl, combine wheat flour and fennel seeds.",
      "Add melted ghee to the flour mixture and rub it in with your fingertips until it resembles breadcrumbs.",
      "Gradually add the jaggery water to the flour mixture and knead into a stiff dough. Do not over-knead.",
      "Take small portions of the dough and press them into desired shapes using a Thekua mould or by hand.",
      "Heat oil in a deep pan over medium-low heat.",
      "Gently slide the Thekuas into the hot oil and fry on low heat until golden brown and crisp on both sides.",
      "Remove with a slotted spoon and drain excess oil on paper towels.",
      "Let them cool completely before storing in an airtight container."
    ]
  },
  {
    "id": "dhooska034",
    "name": "Dhooska",
    "image": "/images/dhooska.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup rice flour",
      "1/2 cup chana dal (split chickpeas), soaked overnight",
      "1/4 cup urad dal (split black gram), soaked overnight",
      "2-3 green chilies",
      "1 inch ginger",
      "1/2 tsp cumin seeds",
      "1/4 tsp turmeric powder",
      "A pinch of asafoetida (hing)",
      "Salt to taste",
      "Oil for deep frying"
    ],
    "stateId": "jharkhand",
    "procedure": [
      "Drain the soaked chana dal and urad dal. Grind them along with green chilies, ginger, and cumin seeds to a smooth paste using minimal water.",
      "Transfer the batter to a large bowl. Add rice flour, turmeric powder, asafoetida, and salt.",
      "Mix well to form a thick, smooth batter. Add a little water if needed to get a pouring consistency, similar to dosa batter.",
      "Let the batter ferment for 4-6 hours in a warm place (optional, but enhances flavor).",
      "Heat oil in a deep pan for deep frying.",
      "Once the oil is hot, pour a ladleful of batter into the oil. It will puff up like a poori.",
      "Fry until golden brown and crisp on both sides.",
      "Remove with a slotted spoon and drain excess oil on paper towels.",
      "Serve hot with ghugni or aloo sabzi."
    ]
  },
  {
    "id": "jadoh052",
    "name": "Jadoh",
    "image": "/images/jadoh.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "2 cups short-grain rice (Joha rice preferred)",
      "500g pork, cut into small pieces",
      "2 large onions, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1 tsp turmeric powder",
      "1/2 tsp black peppercorns, crushed",
      "2-3 bay leaves",
      "2 tbsp oil or pork fat",
      "4 cups water or pork stock",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "meghalaya",
    "procedure": [
      "Wash the rice thoroughly and soak for 30 minutes. Drain and set aside.",
      "Heat oil or pork fat in a large pot or pressure cooker.",
      "Add chopped onions and sauté until translucent.",
      "Add ginger-garlic paste and green chilies, sauté for a minute until fragrant.",
      "Add pork pieces and cook until browned on all sides.",
      "Stir in turmeric powder, crushed black peppercorns, bay leaves, and salt.",
      "Add the soaked and drained rice to the pot and mix well with the pork and spices.",
      "Pour in water or pork stock. Bring to a boil, then reduce heat, cover, and simmer until the rice is cooked and all the liquid is absorbed (about 20-25 minutes). If using a pressure cooker, cook for 2 whistles.",
      "Once cooked, let it rest for 5 minutes before fluffing with a fork.",
      "Garnish with fresh coriander and serve hot."
    ]
  },
  {
    "id": "siddu048",
    "name": "Siddu",
    "image": "/images/siddu.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "2 cups wheat flour",
      "1/2 cup lukewarm water (or as needed)",
      "1 tsp dry yeast",
      "1 tsp sugar",
      "1/2 tsp salt",
      "2 tbsp oil or ghee",
      "For the filling:",
      "1 cup walnut paste",
      "1/2 cup paneer, crumbled (optional)",
      "1/4 cup green peas, boiled and mashed (optional)",
      "1/2 tsp cumin powder",
      "1/2 tsp garam masala",
      "Salt to taste"
    ],
    "stateId": "himachal-pradesh",
    "procedure": [
      "In a small bowl, dissolve yeast and sugar in lukewarm water. Let it sit for 5-10 minutes until frothy.",
      "In a large mixing bowl, combine wheat flour and salt. Add the activated yeast mixture and oil/ghee.",
      "Knead into a soft, pliable dough. Cover with a damp cloth and let it rise in a warm place for 1-2 hours, or until doubled in size.",
      "For the filling: In a bowl, combine walnut paste, crumbled paneer (if using), mashed green peas (if using), cumin powder, garam masala, and salt. Mix well.",
      "Once the dough has risen, punch it down gently. Divide into equal portions.",
      "Take one portion, flatten it into a disc, place a spoonful of the filling in the center, and bring the edges together to seal, forming a ball.",
      "Steam the Suddus in a steamer for 15-20 minutes, or until cooked through and firm to touch.",
      "Serve hot with ghee, green chutney, or dal."
    ]
  },
  {
    "id": "smokedpork054",
    "name": "Smoked Pork with Bamboo Shoot",
    "image": "/images/smokedpork.jpg",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g smoked pork, cut into pieces",
      "1 cup fermented bamboo shoot, sliced",
      "4-5 green chilies, slit",
      "1 inch ginger, julienned",
      "2-3 cloves garlic, minced",
      "1 large onion, sliced",
      "1/2 tsp turmeric powder",
      "Water as needed",
      "Salt to taste (smoked pork is usually salty, so add carefully)",
      "Fresh coriander for garnish"
    ],
    "stateId": "nagaland",
    "procedure": [
      "Wash the smoked pork thoroughly to remove excess salt. You can parboil it for 5-10 minutes if it's very salty, then discard the water.",
      "In a pot, combine smoked pork, sliced bamboo shoot, green chilies, julienned ginger, minced garlic, sliced onion, and turmeric powder.",
      "Add enough water to cover the ingredients. Bring to a boil, then reduce heat and simmer until the pork is tender and the flavors have melded (about 45-60 minutes).",
      "Taste and adjust salt if necessary.",
      "Serve hot with steamed rice, garnished with fresh coriander."
    ]
  },
  {
    "id": "bai053",
    "name": "Bai",
    "image": "/images/bai.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "2 cups mixed vegetables (e.g., pumpkin, beans, brinjal, potatoes), chopped",
      "1/2 cup bamboo shoot, sliced (optional)",
      "1/4 cup fermented soybean (bekang), mashed (optional)",
      "1/2 tsp baking soda",
      "2-3 green chilies, slit",
      "1 inch ginger, crushed",
      "Water as needed",
      "Salt to taste"
    ],
    "stateId": "mizoram",
    "procedure": [
      "In a pot, combine all the chopped mixed vegetables, sliced bamboo shoot (if using), green chilies, and crushed ginger.",
      "Add enough water to just cover the vegetables.",
      "Bring to a boil, then reduce heat and simmer until the vegetables are tender.",
      "If using fermented soybean, mash it and add it to the pot. Stir well.",
      "Add baking soda and salt to taste. Stir gently.",
      "Cook for another 5-7 minutes, allowing the flavors to combine and the broth to thicken slightly.",
      "Serve hot with steamed rice."
    ]
  },
  {
    "id": "dalma031",
    "name": "Dalma",
    "image": "/images/dalma.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup toor dal (split pigeon peas)",
      "2 cups mixed vegetables (e.g., pumpkin, potato, brinjal, raw banana, drumsticks), chopped",
      "1/2 tsp turmeric powder",
      "1/2 tsp cumin powder",
      "1/2 tsp red chili powder (optional)",
      "1/2 tsp garam masala",
      "1 tbsp ghee",
      "1 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Few curry leaves",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "odisha",
    "procedure": [
      "Wash toor dal thoroughly and soak for 30 minutes. Drain.",
      "In a pressure cooker, combine the soaked dal, chopped mixed vegetables, turmeric powder, cumin powder, red chili powder (if using), and enough water (about 3-4 cups).",
      "Cook for 3-4 whistles, or until the dal and vegetables are well cooked and soft.",
      "Once the pressure releases, mash the dal and vegetables lightly with a ladle.",
      "For tempering: Heat ghee in a small pan.",
      "Add mustard seeds, cumin seeds, dry red chilies, asafoetida, and curry leaves. Let them splutter.",
      "Pour the tempering over the cooked dalma. Add garam masala and mix well.",
      "Adjust salt to taste. Simmer for 5 minutes.",
      "Garnish with fresh coriander and serve hot with rice or roti."
    ]
  },
  {
    "id": "chenapoda032",
    "name": "Chhena Poda",
    "image": "/images/chenapoda.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "250g fresh chhena (paneer), crumbled",
      "1/2 cup sugar (adjust to taste)",
      "1/4 cup semolina (sooji)",
      "1/4 cup ghee, melted",
      "1/2 tsp cardamom powder",
      "1 tbsp chopped nuts (cashews, almonds - optional)",
      "A pinch of baking soda (optional, for softer texture)"
    ],
    "stateId": "odisha",
    "procedure": [
      "Preheat oven to 180°C (350°F). Grease a baking pan with ghee and line with parchment paper.",
      "In a large bowl, combine crumbled chhena, sugar, semolina, melted ghee, cardamom powder, and chopped nuts (if using).",
      "Mix everything well with your hands, gently kneading for 5-7 minutes until the chhena is smooth and the sugar is well incorporated. Do not over-knead.",
      "Add a pinch of baking soda (if using) and mix again.",
      "Transfer the mixture to the prepared baking pan and press it down evenly.",
      "Bake for 30-40 minutes, or until the top turns golden brown and the edges are slightly caramelized.",
      "Remove from oven and let it cool completely before slicing into pieces.",
      "Serve at room temperature or chilled."
    ]
  },
  {
    "id": "vada015",
    "name": "Vada Pav",
    "image": "/images/vadapav.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": true,
    "isSpicy": true,
    "ingredients": [
      "4-5 medium potatoes, boiled and mashed",
      "1 cup gram flour (besan)",
      "1/4 tsp turmeric powder",
      "1/4 tsp asafoetida (hing)",
      "1/2 tsp red chili powder",
      "1/2 tsp ginger-garlic paste",
      "2-3 green chilies, chopped",
      "Few curry leaves",
      "1/2 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "8-10 pav (bread buns)",
      "Dry garlic chutney",
      "Green chutney",
      "Oil for deep frying",
      "Salt to taste"
    ],
    "stateId": "maharashtra",
    "procedure": [
      "For the vada filling: Heat 1 tbsp oil in a pan. Add mustard seeds, cumin seeds, curry leaves, green chilies, and ginger-garlic paste. Sauté for a minute.",
      "Add mashed potatoes, turmeric powder, red chili powder, and salt. Mix well and cook for 2-3 minutes. Let it cool.",
      "Shape the potato mixture into small, round balls.",
      "For the besan batter: In a bowl, mix gram flour, turmeric powder, asafoetida, red chili powder, and salt. Add water gradually to make a smooth, thick batter.",
      "Heat oil for deep frying in a kadai.",
      "Dip each potato ball into the besan batter, ensuring it's fully coated.",
      "Gently drop the coated vadas into the hot oil and deep fry until golden brown and crisp.",
      "Remove with a slotted spoon and drain excess oil on paper towels.",
      "To assemble Vada Pav: Slit each pav horizontally, but not all the way through.",
      "Spread dry garlic chutney and green chutney on the inside of the pav.",
      "Place a hot vada inside the pav.",
      "Serve immediately with more chutneys and fried green chilies (optional)."
    ]
  },
  {
    "id": "puranpoli016",
    "name": "Puran Poli",
    "image": "/images/puranpoli.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "For the dough (Poli):",
      "1 cup wheat flour (atta)",
      "1/2 cup all-purpose flour (maida)",
      "1/4 tsp turmeric powder (for color)",
      "2 tbsp oil or ghee",
      "Water as needed to knead",
      "For the filling (Puran):",
      "1 cup chana dal (split chickpeas)",
      "1 cup jaggery, grated",
      "1/2 tsp cardamom powder",
      "A pinch of nutmeg powder",
      "Ghee for cooking"
    ],
    "stateId": "maharashtra",
    "procedure": [
      "For the Puran (filling): Wash chana dal and pressure cook with 2 cups of water for 3-4 whistles until soft. Drain excess water completely.",
      "Mash the cooked dal thoroughly. In a pan, combine mashed dal and grated jaggery. Cook on low heat, stirring continuously, until the jaggery melts and the mixture thickens and leaves the sides of the pan.",
      "Add cardamom powder and nutmeg powder. Mix well. Let the puran cool completely.",
      "For the Poli (dough): In a bowl, combine wheat flour, all-purpose flour, turmeric powder, and oil/ghee. Mix well.",
      "Gradually add water and knead into a soft, pliable dough. Cover with a damp cloth and let it rest for 30 minutes.",
      "To assemble: Divide the dough and puran into equal-sized balls.",
      "Take a dough ball, flatten it slightly, place a puran ball in the center, and bring the edges of the dough together to seal it, forming a stuffed ball.",
      "Dust with flour and gently roll out into a thin, round poli (flatbread).",
      "Heat a tawa (griddle) on medium heat. Cook the poli on both sides, applying ghee, until golden brown spots appear.",
      "Serve hot with ghee or milk."
    ]
  },
  {
    "id": "chole011",
    "name": "Chole Bhature",
    "image": "/images/cholebhature.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For Chole:",
      "1 cup chickpeas (chole), soaked overnight",
      "1 large onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1 tsp chole masala",
      "2-3 green chilies, slit",
      "2 tbsp oil",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish",
      "For Bhature:",
      "2 cups all-purpose flour (maida)",
      "1/4 cup semolina (sooji)",
      "1/4 cup yogurt",
      "1/2 tsp baking soda",
      "1 tsp sugar",
      "1/2 tsp salt",
      "Water as needed to knead",
      "Oil for deep frying"
    ],
    "stateId": "punjab",
    "procedure": [
      "For Chole: Pressure cook soaked chickpeas with a pinch of baking soda and enough water for 5-6 whistles until soft. Drain and set aside.",
      "Heat oil in a pan. Add chopped onion and sauté until golden brown. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add tomato puree and cook until oil separates. Stir in cumin powder, coriander powder, turmeric powder, red chili powder, chole masala, and salt. Cook for 2-3 minutes.",
      "Add the cooked chickpeas and 1 cup of water. Bring to a boil, then simmer for 10-15 minutes, mashing a few chickpeas to thicken the gravy.",
      "Garnish with fresh coriander.",
      "For Bhature: In a large bowl, combine all-purpose flour, semolina, yogurt, baking soda, sugar, and salt. Mix well.",
      "Gradually add water and knead into a soft, smooth dough. Cover with a damp cloth and let it rest for 1-2 hours.",
      "Heat oil for deep frying in a kadai.",
      "Take small portions of the dough, roll them into oval or round shapes.",
      "Gently slide the rolled bhature into the hot oil. Press gently with a slotted spoon to puff them up. Fry until golden brown on both sides.",
      "Remove and drain excess oil on paper towels.",
      "Serve hot chole with freshly fried bhature, sliced onions, and lemon wedges."
    ]
  },
  {
  "id": "fishcurry001",
  "name": "Bengali Fish Curry",
  "image": "/images/bengalifishcurry.jpg",
  "difficulty": "moderate",
  "isVeg": false,
  "type": "lunch",
  "isInstant": false,
  "isSpicy": true,
  "ingredients": [
    "500g rohu or katla fish, cleaned and cut",
    "2 potatoes, diced",
    "2 onions, finely chopped",
    "2 tomatoes, chopped",
    "1 tbsp ginger-garlic paste",
    "1/2 tsp turmeric powder",
    "1 tsp red chili powder",
    "1 tsp cumin powder",
    "1 tsp garam masala",
    "1/2 tsp mustard seeds",
    "3 tbsp mustard oil",
    "Salt to taste",
    "Fresh coriander leaves for garnish"
  ],
  "stateId": "westbengal",
  "procedure": [
    "Marinate fish pieces with salt and turmeric for 15 minutes.",
    "Heat mustard oil until it smokes, fry the fish until golden. Set aside.",
    "In the same oil, add mustard seeds, chopped onions, and sauté until golden.",
    "Add ginger-garlic paste, potatoes, and spices. Cook until oil separates.",
    "Add tomatoes and cook until soft. Add water and bring to boil.",
    "Add fried fish, simmer for 10 minutes.",
    "Garnish with fresh coriander and serve with rice."
  ]
}
,{
  "id": "ayasam001",
  "name": "Kerala Payasam",
  "image": "/images/keralapayasam.jpg",
  "difficulty": "easy",
  "isVeg": true,
  "type": "dessert",
  "isInstant": false,
  "isSpicy": false,
  "ingredients": [
    "1/2 cup rice or vermicelli (ada or semiya)",
    "1 liter full cream milk",
    "1/2 cup jaggery or sugar",
    "1/4 cup coconut milk (optional)",
    "2 tbsp ghee",
    "10 cashews",
    "10 raisins",
    "1/2 tsp cardamom powder"
  ],
  "stateId": "kerala",
  "procedure": [
    "Cook rice/vermicelli in milk until soft.",
    "Add jaggery/sugar and stir until fully dissolved.",
    "Add coconut milk if using and simmer briefly.",
    "Heat ghee in a pan, fry cashews and raisins.",
    "Add to the payasam along with cardamom powder.",
    "Serve warm or chilled."
  ]
}
,{
  "id": "dhokla001",
  "name": "Gujarati Dhokla",
  "image": "/images/dhokla.jpg",
  "difficulty": "easy",
  "isVeg": true,
  "type": "snack",
  "isInstant": true,
  "isSpicy": false,
  "ingredients": [
    "1 cup gram flour (besan)",
    "1 tbsp semolina (sooji)",
    "1 tbsp lemon juice",
    "1 tsp ENO fruit salt or baking soda",
    "1/2 cup water",
    "Salt to taste",
    "For tempering:",
    "1 tbsp oil",
    "1 tsp mustard seeds",
    "2 green chilies, slit",
    "A few curry leaves",
    "1 tsp sugar",
    "2 tbsp water"
  ],
  "stateId": "gujarat",
  "procedure": [
    "Mix besan, sooji, lemon juice, salt, and water into a smooth batter.",
    "Add ENO fruit salt, mix well, and immediately pour into a greased dish.",
    "Steam for 15-20 minutes or until a toothpick comes out clean.",
    "Cool and cut into squares.",
    "Heat oil, add mustard seeds, green chilies, curry leaves. Add sugar + water.",
    "Pour tempering over dhokla and serve."
  ]
}
,{
  "id": "dalbaatichurma001",
  "name": "Dal Baati Churma",
  "image": "/images/dalbaatichurma.jpg",
  "difficulty": "hard",
  "isVeg": true,
  "type": "lunch",
  "isInstant": false,
  "isSpicy": true,
  "ingredients": [
    "For Dal:",
    "1/4 cup chana dal",
    "1/4 cup toor dal",
    "1/4 cup moong dal",
    "1/4 cup urad dal",
    "1/4 cup masoor dal",
    "1 onion, finely chopped",
    "2 tomatoes, chopped",
    "1 tsp ginger-garlic paste",
    "1/2 tsp turmeric powder",
    "1 tsp red chili powder",
    "1 tsp coriander powder",
    "1 tsp cumin seeds",
    "2 tbsp ghee",
    "Salt to taste",
    "Fresh coriander leaves for garnish",

    "For Baati:",
    "2 cups whole wheat flour",
    "1/2 cup semolina (sooji)",
    "1/2 cup ghee",
    "1/2 tsp ajwain (carom seeds)",
    "Salt to taste",
    "Water for kneading",

    "For Churma:",
    "1 cup whole wheat flour",
    "1/4 cup semolina",
    "1/2 cup ghee (for dough + roasting)",
    "1/2 cup powdered jaggery or sugar",
    "2 tbsp chopped nuts (almonds, cashews)",
    "1/2 tsp cardamom powder"
  ],
  "stateId": "rajasthan",
  "procedure": [
    "For Dal: Wash all the dals and pressure cook with turmeric and salt for 4-5 whistles until soft.",
    "Heat ghee in a pan, add cumin seeds. Once they splutter, add onion, ginger-garlic paste, and sauté till golden.",
    "Add tomatoes, red chili powder, coriander powder. Cook till tomatoes soften.",
    "Add cooked dal, mix well and simmer for 10 minutes. Garnish with coriander leaves.",

    "For Baati: Mix flour, semolina, ajwain, salt, and ghee. Knead into a firm dough using water. Divide into equal portions and shape into round balls.",
    "Preheat the oven to 180°C. Bake the baatis for 25-30 minutes or until golden, flipping once halfway.",
    "Dip hot baatis in melted ghee before serving.",

    "For Churma: Mix flour, semolina, and ghee. Knead into a stiff dough. Make small balls and bake or fry until golden brown.",
    "Crush into coarse powder once cooled. Mix with jaggery/sugar, nuts, and cardamom powder.",
    "Add ghee to enhance flavor and bind the mixture slightly."
  ]
},

  {
    "id": "sarson012",
    "name": "Punjabi Sarson da Saag",
    "image": "/images/sarson.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "500g mustard leaves (sarson), washed and chopped",
      "250g spinach (palak), washed and chopped",
      "100g bathua (chenopodium album), washed and chopped (optional)",
      "1 large onion, chopped",
      "1 tbsp ginger, chopped",
      "1 tbsp garlic, chopped",
      "2-3 green chilies, chopped",
      "1/4 cup makki atta (cornmeal)",
      "2 tbsp ghee or butter",
      "1 tsp cumin seeds",
      "A pinch of asafoetida (hing)",
      "Water as needed",
      "Salt to taste"
    ],
    "stateId": "punjab",
    "procedure": [
      "In a large pot, combine chopped mustard leaves, spinach, bathua (if using), half of the chopped onion, ginger, garlic, and green chilies. Add 1 cup of water and salt.",
      "Bring to a boil, then reduce heat, cover, and simmer until the greens are very soft (about 45-60 minutes).",
      "Once cooked, let it cool slightly. Blend the mixture using an immersion blender or a regular blender (do not make it too smooth, keep it slightly coarse).",
      "Return the blended saag to the pot. Gradually add makki atta, stirring continuously to avoid lumps. Cook on low heat for 15-20 minutes, stirring occasionally, until the raw taste of makki atta is gone and the saag thickens.",
      "For tempering (Tadka): Heat ghee or butter in a small pan.",
      "Add cumin seeds and asafoetida. Let them splutter.",
      "Add the remaining chopped onion and sauté until golden brown.",
      "Pour the tempering over the saag and mix well.",
      "Serve hot with Makki di Roti (cornmeal flatbread) and a dollop of white butter or ghee."
    ]
  },
  {
    "id": "dalbati019",
    "name": "Dal Baati Churma",
    "image": "/images/dalbati.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For Baati:",
      "2 cups wheat flour",
      "1/2 cup semolina (sooji)",
      "1/4 cup ghee, melted",
      "1/2 tsp carom seeds (ajwain)",
      "1/2 tsp baking soda",
      "Salt to taste",
      "Water as needed to knead",
      "For Dal:",
      "1/2 cup toor dal (split pigeon peas)",
      "1/4 cup chana dal (split chickpeas)",
      "1/4 cup moong dal (split green gram)",
      "1/4 cup urad dal (split black gram)",
      "1 large onion, finely chopped",
      "2 tomatoes, pureed",
      "1 tbsp ginger-garlic paste",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1 tbsp ghee",
      "1 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Few curry leaves",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish",
      "For Churma:",
      "1 cup wheat flour",
      "1/4 cup ghee, melted",
      "1/2 cup jaggery, grated",
      "1/4 tsp cardamom powder",
      "Chopped nuts (optional)"
    ],
    "stateId": "rajasthan",
    "procedure": [
      "For Baati: In a bowl, combine wheat flour, semolina, carom seeds, baking soda, and salt. Add melted ghee and rub it into the flour.",
      "Gradually add water and knead into a stiff dough. Cover and let it rest for 20 minutes.",
      "Divide the dough into equal portions and shape into round balls. Press lightly in the center.",
      "Preheat oven to 180°C (350°F). Bake the baatis for 25-30 minutes, or until golden brown and cooked through. Alternatively, cook in a traditional baati maker or on a gas tandoor.",
      "For Dal: Wash all dals and pressure cook with 4 cups of water, turmeric, and salt for 4-5 whistles until soft. Mash lightly.",
      "Heat ghee in a pan. Add mustard seeds, cumin seeds, dry red chilies, asafoetida, and curry leaves. Let them splutter.",
      "Add chopped onion and sauté until golden. Add ginger-garlic paste and sauté for a minute.",
      "Add tomato puree, cumin powder, coriander powder, and red chili powder. Cook until oil separates.",
      "Add the cooked dal and water to adjust consistency. Simmer for 10-15 minutes. Garnish with fresh coriander.",
      "For Churma: In a bowl, combine wheat flour and melted ghee. Mix well to form a crumbly mixture.",
      "Press portions of the mixture into small, tight balls (muthias).",
      "Deep fry the muthias on low heat until golden brown and crisp. Let them cool completely.",
      "Once cooled, crush the muthias into a coarse powder using a mixer grinder.",
      "Add grated jaggery, cardamom powder, and chopped nuts (if using) to the crushed churma. Mix well.",
      "To serve: Crush hot baatis and pour generous amounts of melted ghee over them. Serve with dal and churma."
    ]
  },
  {
    "id": "ghevar020",
    "name": "Ghevar",
    "image": "/images/ghevar.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup all-purpose flour (maida)",
      "1/4 cup ghee, melted and chilled",
      "1/2 cup milk",
      "2 cups chilled water",
      "1/2 tsp lemon juice",
      "Ice cubes",
      "Oil or ghee for deep frying",
      "For Sugar Syrup:",
      "1 cup sugar",
      "1/2 cup water",
      "1/4 tsp cardamom powder",
      "Few saffron strands (optional)",
      "For Garnish:",
      "Chopped nuts (pistachios, almonds)",
      "Rabri (thickened milk) or malai (cream) (optional)"
    ],
    "stateId": "rajasthan",
    "procedure": [
      "For the batter: In a large bowl, combine chilled melted ghee and ice cubes. Rub vigorously with your hands until the ghee turns white and creamy.",
      "Remove ice cubes. Gradually add all-purpose flour and milk, alternating, mixing well to avoid lumps. The batter should be smooth and lump-free.",
      "Slowly add chilled water and lemon juice, mixing continuously to form a thin, free-flowing batter. The consistency should be like thin pancake batter.",
      "Heat oil or ghee in a deep, narrow pan (about 4-5 inches deep) over medium-high heat. The oil should be very hot.",
      "Pour a ladleful of batter from a height into the center of the hot oil. The batter will sizzle and form a lacy network. Make a hole in the center with a stick.",
      "Pour another ladleful of batter into the hole. Repeat this 3-4 times, allowing each layer to cook slightly before adding the next, until you achieve desired thickness.",
      "Once the ghevar is golden brown and crisp, carefully lift it out using a skewer or stick inserted through the hole. Drain excess oil.",
      "Place the cooked ghevar on a wire rack over a plate to drain any remaining oil.",
      "For Sugar Syrup: In a saucepan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency.",
      "Add cardamom powder and saffron strands (if using). Let it cool slightly.",
      "Dip each ghevar in the warm sugar syrup, ensuring it's coated evenly. Let excess syrup drip off.",
      "Garnish with chopped nuts and rabri or malai (if using).",
      "Serve immediately or store in an airtight container."
    ]
  },
  {
    "id": "pesaratu001",
    "name": "Pesaratu",
    "image": "/images/pesaratu.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup whole green gram (moong dal), soaked overnight",
      "1/4 cup rice",
      "1 inch ginger, chopped",
      "2-3 green chilies, chopped",
      "1/2 tsp cumin seeds",
      "1 large onion, finely chopped (for topping)",
      "Oil for cooking",
      "Salt to taste"
    ],
    "stateId": "andhra-pradesh",
    "procedure": [
      "Drain the soaked green gram and rice. Grind them together with ginger, green chilies, and cumin seeds to a smooth batter using minimal water.",
      "Transfer the batter to a bowl. Add salt and mix well. The consistency should be similar to dosa batter.",
      "Heat a non-stick tawa (griddle) on medium heat. Grease lightly with oil.",
      "Pour a ladleful of batter onto the hot tawa and spread it evenly in a circular motion to form a thin dosa.",
      "Sprinkle finely chopped onions over the pesaratu (optional).",
      "Drizzle a little oil around the edges and cook until golden brown and crisp.",
      "Flip and cook for another minute on the other side.",
      "Serve hot with ginger chutney or coconut chutney."
    ]
  },
  {
    "id": "gongura002",
    "name": "Gongura Pachadi",
    "image": "/images/gongura.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "2 cups fresh gongura leaves (sorrel leaves), washed and drained",
      "8-10 dry red chilies (adjust to spice preference)",
      "1 tbsp coriander seeds",
      "1 tsp cumin seeds",
      "1/2 tsp fenugreek seeds",
      "4-5 cloves garlic",
      "1 small onion, roughly chopped (optional)",
      "2 tbsp oil",
      "1/2 tsp mustard seeds",
      "1/2 tsp urad dal (split black gram)",
      "Few curry leaves",
      "A pinch of asafoetida (hing)",
      "Salt to taste"
    ],
    "stateId": "andhra-pradesh",
    "procedure": [
      "Heat 1 tbsp oil in a pan. Add dry red chilies, coriander seeds, cumin seeds, and fenugreek seeds. Roast until fragrant. Remove and set aside.",
      "In the same pan, add the remaining 1 tbsp oil. Add gongura leaves and sauté until they wilt and change color. Remove and let cool.",
      "Grind the roasted spices, garlic, and chopped onion (if using) to a coarse powder.",
      "Add the sautéed gongura leaves and salt to the grinder. Grind to a coarse paste. Do not add water.",
      "For tempering: Heat 1 tbsp oil in a small pan. Add mustard seeds, urad dal, dry red chili (optional), curry leaves, and asafoetida. Let them splutter.",
      "Pour the tempering over the gongura pachadi and mix well.",
      "Serve with hot steamed rice and ghee."
    ]
  },
  {
    "id": "HyderabadiBiryani",
    "name": "Hyderabadi Biryani",
    "image": "https://images.unsplash.com/photo-1631515243349-e0cb75fb8d3a?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8Y2hpY2tlbiUyMGJpcnlhbml8ZW58MHx8MHx8fDA%3D",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g chicken, cut into pieces",
      "2 cups basmati rice, soaked for 30 minutes",
      "1 cup plain yogurt",
      "2 large onions, thinly sliced and fried until golden brown (birista)",
      "1/4 cup mint leaves, chopped",
      "1/4 cup coriander leaves, chopped",
      "2 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1 tsp red chili powder",
      "1 tsp turmeric powder",
      "1 tbsp biryani masala",
      "Whole spices (cinnamon stick, cardamom pods, cloves, bay leaves)",
      "1/4 cup ghee or oil",
      "A pinch of saffron strands, soaked in 2 tbsp warm milk",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "telangana",
    "procedure": [
      "Marinate chicken with yogurt, ginger-garlic paste, red chili powder, turmeric powder, biryani masala, half of the fried onions, mint leaves, coriander leaves, green chilies, and salt. Let it marinate for at least 1 hour.",
      "In a large pot, bring water to a boil with some salt and whole spices. Add the soaked basmati rice and cook until 70% done. Drain the rice.",
      "In a heavy-bottomed pot, spread a layer of marinated chicken at the bottom.",
      "Layer the partially cooked rice over the chicken.",
      "Sprinkle the remaining fried onions, mint leaves, coriander leaves, and saffron milk over the rice.",
      "Drizzle ghee or oil on top.",
      "Cover the pot tightly with a lid (you can seal the edges with dough for dum cooking).",
      "Cook on high heat for 5-7 minutes, then reduce heat to low and cook for 20-25 minutes, or until the chicken is cooked and rice is fully done.",
      "Let it rest for 10 minutes before gently mixing and serving hot with raita and mirchi ka salan."
    ]
  },
  
  {
    "id": "SarvaPindi",
    "name": "Sarva Pindi",
    "image": "https://images.unsplash.com/photo-1601050690597-df0568f70950?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8c2FydmElMjBwaW5kaXxlbnwwfHwwfDB8MA%3D%3D",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup rice flour",
      "1/4 cup roasted peanuts, crushed",
      "1 large onion, finely chopped",
      "2-3 green chilies, finely chopped",
      "1 tbsp ginger-garlic paste",
      "1/2 tsp cumin seeds",
      "1/2 tsp red chili powder",
      "1/4 tsp turmeric powder",
      "Few curry leaves, chopped",
      "1/4 cup fresh coriander, chopped",
      "2 tbsp oil",
      "Water as needed to knead",
      "Salt to taste"
    ],
    "stateId": "telangana",
    "procedure": [
      "In a large bowl, combine rice flour, crushed peanuts, chopped onion, green chilies, ginger-garlic paste, cumin seeds, red chili powder, turmeric powder, curry leaves, chopped coriander, and salt.",
      "Heat 2 tbsp oil and add it to the flour mixture. Mix well.",
      "Gradually add warm water and knead into a soft, pliable dough.",
      "Grease a heavy-bottomed pan or a deep dish with oil.",
      "Take a portion of the dough and spread it evenly on the bottom of the greased pan, pressing it with your fingers to form a thin layer.",
      "Make a few holes in the dough with your finger to allow even cooking.",
      "Place the pan on low heat and cook, covered, until the bottom is golden brown and crisp (about 15-20 minutes).",
      "Flip and cook the other side for 5-7 minutes until cooked through.",
      "Serve hot with peanut chutney or yogurt."
    ]
  },
  {
    "id": "Gongura-Pachadi",
    "name": "Gongura Pachadi",
    "image": "https://images.unsplash.com/photo-1617196038433-5b8b3c5e6c4e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8Z29uZ3VyYSUyMHBhY2hhZGklMjB0ZWxhbmdhbmF8ZW58MHx8MHx8MA%3D%3D",
    "difficulty": "easy",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "2 cups fresh gongura leaves (sorrel leaves), washed and drained",
      "8-10 green chilies (adjust to spice preference)",
      "1 small piece of tamarind (optional, if gongura is not sour enough)",
      "4-5 cloves garlic",
      "1/2 tsp cumin seeds",
      "2 tbsp oil",
      "1/2 tsp mustard seeds",
      "1/2 tsp urad dal (split black gram)",
      "Few curry leaves",
      "A pinch of asafoetida (hing)",
      "Salt to taste"
    ],
    "stateId": "telangana",
    "procedure": [
      "Heat 1 tbsp oil in a pan. Add green chilies and sauté until slightly blistered. Remove and set aside.",
      "In the same pan, add the remaining 1 tbsp oil. Add gongura leaves and sauté until they wilt and change color. If using tamarind, add it now and sauté for a minute. Remove and let cool.",
      "Grind the sautéed green chilies, garlic, cumin seeds, and salt to a coarse paste.",
      "Add the sautéed gongura leaves (and tamarind if used) to the grinder. Grind to a coarse paste. Do not add water.",
      "For tempering: Heat 1 tbsp oil in a small pan. Add mustard seeds, urad dal, dry red chili (optional), curry leaves, and asafoetida. Let them splutter.",
      "Pour the tempering over the gongura pachadi and mix well.",
      "Serve with hot steamed rice and ghee."
    ]
  },
  {
    "id": "QubaniKaMeetha",
    "name": "Qubani Ka Meetha",
    "image": "https://images.unsplash.com/photo-1617196038433-5b8b3c5e6c4e?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Nnx8cXVibWFuaSUyMGthJTIwbWVldGhhfGVufDB8fDB8fHww",
    "difficulty": "easy",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup dried apricots (qubani), pitted and halved",
      "1/2 cup sugar (adjust to sweetness of apricots)",
      "2 cups water",
      "1/4 cup blanched almonds, slivered (for garnish)",
      "1/4 cup fresh cream or malai (for serving)"
    ],
    "stateId": "telangana",
    "procedure": [
      "Wash dried apricots thoroughly. Soak them in 2 cups of water overnight or for at least 4-6 hours until they are plump and soft.",
      "Once soaked, remove the pits (if any) and reserve the soaking water.",
      "In a saucepan, combine the soaked apricots and the reserved soaking water. Bring to a boil, then reduce heat and simmer until the apricots are very soft and mushy.",
      "Mash the apricots with a spoon or potato masher. Add sugar and mix well. Continue to cook on low heat, stirring occasionally, until the mixture thickens to a jam-like consistency.",
      "Let it cool completely.",
      "Serve chilled, garnished with slivered blanched almonds and a dollop of fresh cream or malai."
    ]
  },
  {
    "id": "gongura",
    "name": "Gongura Mutton",
    "image": "https://images.unsplash.com/photo-1631515243349-e0cb75fb8d3a?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8OHx8Z29uZ3VyYSUyMG11dHRvbnxlbnwwfHwwfHx8MA%3D%3D",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g mutton, cut into pieces",
      "2 cups fresh gongura leaves (sorrel leaves), washed and drained",
      "2 large onions, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp garam masala",
      "2 tbsp oil",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "telangana",
    "procedure": [
      "Heat 1 tbsp oil in a pan. Add gongura leaves and sauté until they wilt and change color. Remove and set aside. Grind to a coarse paste once cooled.",
      "Heat the remaining 1 tbsp oil in a pressure cooker or heavy-bottomed pot.",
      "Add chopped onions and sauté until golden brown. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add mutton pieces and sear on all sides until browned.",
      "Stir in red chili powder, coriander powder, turmeric powder, and salt. Cook for 2-3 minutes.",
      "Add the ground gongura paste and mix well with the mutton. Cook for 5-7 minutes, stirring occasionally.",
      "Add 1 cup of water, bring to a boil, then close the pressure cooker lid. Cook for 4-5 whistles, or until the mutton is tender.",
      "If cooking in a pot, add more water as needed and simmer until mutton is tender.",
      "Once cooked, add garam masala and simmer for another 5 minutes.",
      "Garnish with fresh coriander and serve hot with rice or roti."
    ]
  },
  {
    "id": "Baigan",
    "name": "Bagara Baingan",
    "image": "https://images.unsplash.com/photo-1620082872376-efba90453a55?w=500&auto=format&fit=crop&q=60",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "6-8 small eggplants (baingan), slit crosswise from the bottom, keeping the stem intact",
      "For the paste:",
      "1/4 cup roasted peanuts",
      "2 tbsp sesame seeds",
      "1 tbsp desiccated coconut",
      "1 tbsp coriander seeds",
      "1 tsp cumin seeds",
      "4-5 dry red chilies",
      "1 large onion, roughly chopped",
      "1 tbsp ginger-garlic paste",
      "1 small piece of tamarind, soaked in water",
      "For the gravy:",
      "2 tbsp oil",
      "1 tsp mustard seeds",
      "1/2 tsp fenugreek seeds",
      "Few curry leaves",
      "A pinch of asafoetida (hing)",
      "1/2 tsp turmeric powder",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "telangana",
    "procedure": [
      "For the paste: Dry roast peanuts, sesame seeds, desiccated coconut, coriander seeds, cumin seeds, and dry red chilies until fragrant. Let them cool.",
      "Grind the roasted ingredients with chopped onion, ginger-garlic paste, and soaked tamarind (with a little water) to a smooth paste.",
      "Stuff the slit eggplants with some of the prepared paste.",
      "Heat oil in a heavy-bottomed pan or kadai.",
      "Add mustard seeds, fenugreek seeds, curry leaves, and asafoetida. Let them splutter.",
      "Add the stuffed eggplants and sauté gently for 5-7 minutes until they are lightly browned.",
      "Add the remaining paste and turmeric powder to the pan. Mix well and cook for 5 minutes.",
      "Add 1-1.5 cups of water and salt to taste. Bring to a boil, then reduce heat, cover, and simmer until the eggplants are tender and the gravy thickens (about 15-20 minutes).",
      "Garnish with fresh coriander and serve hot with rice or roti."
    ]
  },
  {
    "id": "DoubleKaMeetha",
    "name": "Double Ka Meetha",
    "image": "https://images.unsplash.com/photo-1578985545062-69928b1d9587?w=500&auto=format&fit=crop&q=60",
    "difficulty": "easy",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "8-10 slices of white bread, crusts removed",
      "1/2 cup ghee or oil for frying",
      "For Sugar Syrup:",
      "1 cup sugar",
      "1 cup water",
      "1/4 tsp cardamom powder",
      "Few saffron strands (optional)",
      "For Milk Rabri:",
      "2 cups full-fat milk",
      "1/4 cup condensed milk (optional, for richness)",
      "1/4 tsp cardamom powder",
      "Chopped dry fruits (almonds, pistachios, cashews) for garnish"
    ],
    "stateId": "telangana",
    "procedure": [
      "Cut the bread slices into triangles or squares.",
      "Heat ghee or oil in a pan. Deep fry the bread pieces until golden brown and crisp. Remove and drain excess oil on paper towels.",
      "For Sugar Syrup: In a saucepan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency. Add cardamom powder and saffron strands (if using). Keep warm.",
      "For Milk Rabri: In another saucepan, bring milk to a boil. Reduce heat and simmer, stirring occasionally, until it thickens and reduces to about half its original volume. Add condensed milk (if using) and cardamom powder. Mix well.",
      "Dip the fried bread pieces into the warm sugar syrup for a few seconds, ensuring they are coated but not soggy. Arrange them in a serving dish.",
      "Pour the warm milk rabri over the bread pieces, ensuring they are well covered.",
      "Garnish generously with chopped dry fruits.",
      "Serve warm or chilled."
    ]
  },
  {
    "id": "mui057",
    "name": "Mui Borok",
    "image": "/images/muiborek.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "200g berma (fermented fish), roasted or fried",
      "2 cups mixed vegetables (e.g., brinjal, potato, beans, pumpkin), chopped",
      "2-3 green chilies, slit",
      "1 large onion, chopped",
      "1 inch ginger, crushed",
      "2-3 cloves garlic, crushed",
      "Water as needed",
      "Salt to taste (berma is salty, so add carefully)",
      "Fresh coriander for garnish"
    ],
    "stateId": "tripura",
    "procedure": [
      "If using raw berma, roast it over an open flame or fry lightly until fragrant. Break it into smaller pieces.",
      "In a pot, combine chopped mixed vegetables, green chilies, chopped onion, crushed ginger, and crushed garlic.",
      "Add the roasted/fried berma pieces.",
      "Add enough water to just cover the ingredients. Bring to a boil, then reduce heat and simmer until the vegetables are tender and the flavors have melded (about 15-20 minutes).",
      "Taste and adjust salt if necessary.",
      "Garnish with fresh coriander and serve hot with steamed rice."
    ]
  },
  {
    "id": "tunday021",
    "name": "Tunday Kababi",
    "image": "/images/tunday.jpg",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g finely minced meat (lamb or buffalo), preferably hand-minced",
      "2 tbsp ginger-garlic paste",
      "1 tbsp raw papaya paste (tenderizer)",
      "1 tsp red chili powder",
      "1 tsp garam masala",
      "1/2 tsp black cardamom powder",
      "1/2 tsp green cardamom powder",
      "1/2 tsp cinnamon powder",
      "1/2 tsp mace powder",
      "1/2 tsp nutmeg powder",
      "1/4 tsp cloves powder",
      "1/4 cup fried onion paste",
      "2 tbsp roasted chana dal flour (sattu)",
      "2 tbsp ghee, melted",
      "1 tbsp rose water (optional)",
      "1 tbsp kewra water (optional)",
      "Salt to taste",
      "Oil or ghee for shallow frying"
    ],
    "stateId": "uttar-pradesh",
    "procedure": [
      "In a large bowl, combine minced meat, ginger-garlic paste, raw papaya paste, red chili powder, garam masala, black cardamom powder, green cardamom powder, cinnamon powder, mace powder, nutmeg powder, cloves powder, fried onion paste, roasted chana dal flour, melted ghee, rose water (if using), kewra water (if using), and salt.",
      "Mix everything very thoroughly, kneading the mixture for 10-15 minutes until it becomes smooth and cohesive. This is crucial for the melt-in-mouth texture.",
      "Cover and refrigerate for at least 2 hours, or preferably overnight, to allow the flavors to meld.",
      "Heat oil or ghee in a shallow pan or tawa over medium heat.",
      "Take small portions of the mixture and flatten them into thin patties (kebabs).",
      "Gently place the kebabs in the hot oil and shallow fry until golden brown and cooked through on both sides.",
      "Serve hot with paratha, roomali roti, or naan, and sliced onions with lemon."
    ]
  },
  {
    "id": "peda022",
    "name": "Mathura Peda",
    "image": "/images/peda.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "sweet",
    "isInstant": true,
    "isSpicy": false,
    "ingredients": [
      "1 cup khoya (mawa), grated or crumbled",
      "1/2 cup powdered sugar (adjust to taste)",
      "1/4 tsp cardamom powder",
      "1 tbsp ghee (optional, for richness)",
      "A few saffron strands (optional, for color and flavor)"
    ],
    "stateId": "uttar-pradesh",
    "procedure": [
      "In a heavy-bottomed pan, add grated khoya. Cook on low heat, stirring continuously, until it turns light golden brown and releases a nutty aroma (about 8-10 minutes). Be careful not to burn it.",
      "Remove from heat and let it cool slightly. It should still be warm but not hot.",
      "Add powdered sugar, cardamom powder, and saffron strands (if using) to the warm khoya. Mix well until everything is thoroughly combined and forms a dough-like consistency.",
      "If the mixture is too dry, add a little melted ghee and mix again.",
      "Take small portions of the mixture and shape them into round or oval pedas. You can press a thumb impression in the center or decorate with a pistachio.",
      "Serve immediately or store in an airtight container at room temperature for a few days or in the refrigerator for longer."
    ]
  },
  {
    "id": "idli007",
    "name": "Idli",
    "image": "/images/idli.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "breakfast",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "2 cups idli rice (parboiled rice)",
      "1 cup urad dal (split black gram), dehusked",
      "1/2 tsp fenugreek seeds (methi dana)",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "tamil-nadu",
    "procedure": [
      "Wash idli rice and urad dal separately until the water runs clear. Soak them separately for 4-6 hours (or overnight). Add fenugreek seeds to the urad dal while soaking.",
      "First, grind the urad dal and fenugreek seeds to a very smooth and fluffy batter using cold water. This may take 15-20 minutes in a wet grinder or 5-7 minutes in a mixer grinder.",
      "Then, grind the idli rice to a slightly coarse batter. Combine both batters in a large bowl.",
      "Add salt and mix well with your hands. The warmth from your hands helps in fermentation.",
      "Cover the bowl and let it ferment in a warm place for 8-12 hours, or until the batter doubles in volume and becomes frothy.",
      "Grease idli moulds with a little oil. Pour the fermented batter into the moulds.",
      "Steam the idlis in an idli cooker or steamer for 10-12 minutes, or until a toothpick inserted comes out clean.",
      "Let them cool for a minute before demoulding.",
      "Serve hot with sambar and coconut chutney."
    ]
  },
  {
    "id": "sambar008",
    "name": "Sambar",
    "image": "/images/sambar.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1/2 cup toor dal (split pigeon peas)",
      "2 cups mixed vegetables (e.g., drumsticks, pumpkin, brinjal, carrots, potatoes), chopped",
      "1 small onion, roughly chopped",
      "1 tomato, roughly chopped",
      "1 small lemon-sized ball of tamarind, soaked in warm water",
      "2 tbsp sambar powder",
      "1/2 tsp turmeric powder",
      "1 tbsp oil",
      "1 tsp mustard seeds",
      "1/2 tsp fenugreek seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Few curry leaves",
      "Fresh coriander for garnish",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "tamil-nadu",
    "procedure": [
      "Wash toor dal and pressure cook with 2 cups of water and turmeric powder for 3-4 whistles until soft. Mash lightly and set aside.",
      "Extract tamarind pulp from the soaked tamarind and discard the fibrous part.",
      "In a large pot, combine chopped mixed vegetables, chopped onion, chopped tomato, and 1 cup of water. Cook until the vegetables are half done.",
      "Add the tamarind pulp, sambar powder, and salt to the vegetables. Cook for 5-7 minutes until the raw smell of tamarbar powder disappears.",
      "Add the mashed toor dal to the vegetable mixture. Add more water if needed to adjust consistency. Bring to a boil and simmer for 10-15 minutes, allowing flavors to meld.",
      "For tempering: Heat oil in a small pan. Add mustard seeds, fenugreek seeds, dry red chilies, asafoetida, and curry leaves. Let them splutter.",
      "Pour the tempering over the simmering sambar. Mix well.",
      "Garnish with fresh coriander and serve hot with idli, dosa, or rice."
    ]
  },
  {
    "id": "poha025",
    "name": "Poha",
    "image": "/images/poha.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "breakfast",
    "isInstant": true,
    "isSpicy": true,
    "ingredients": [
      "2 cups thick flattened rice (poha)",
      "1 large onion, finely chopped",
      "1/4 cup roasted peanuts",
      "2-3 green chilies, slit",
      "Few curry leaves",
      "1/2 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "1/4 tsp turmeric powder",
      "1 tbsp oil",
      "Juice of 1/2 lemon",
      "Fresh coriander for garnish",
      "Salt to taste"
    ],
    "stateId": "madhya-pradesh",
    "procedure": [
      "Place poha in a colander and rinse gently under running water for a minute until it softens. Drain well and set aside.",
      "Heat oil in a pan. Add mustard seeds and cumin seeds. Let them splutter.",
      "Add green chilies and curry leaves. Sauté for a few seconds.",
      "Add chopped onion and sauté until translucent.",
      "Add turmeric powder and mix well.",
      "Add the drained poha and roasted peanuts. Mix gently, ensuring the poha doesn't break.",
      "Add salt to taste. Cover and cook on low heat for 2-3 minutes, allowing the flavors to combine.",
      "Turn off the heat. Squeeze lemon juice over the poha and mix gently.",
      "Garnish with fresh coriander and serve hot."
    ]
  },
  {
    "id": "bhutte026",
    "name": "Bhutte Ka Kees",
    "image": "/images/bhutte.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "2 cups fresh corn kernels, grated or coarsely ground",
      "1 cup milk",
      "1 tbsp ghee or oil",
      "1/2 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "2-3 green chilies, finely chopped",
      "1 inch ginger, grated",
      "Few curry leaves",
      "1/4 tsp turmeric powder",
      "1/2 tsp red chili powder (optional)",
      "1/4 cup fresh coriander, chopped",
      "Juice of 1/2 lemon",
      "Salt to taste"
    ],
    "stateId": "madhya-pradesh",
    "procedure": [
      "Grate or coarsely grind the fresh corn kernels.",
      "Heat ghee or oil in a pan. Add mustard seeds and cumin seeds. Let them splutter.",
      "Add green chilies, grated ginger, and curry leaves. Sauté for a minute until fragrant.",
      "Add the grated corn and mix well. Cook for 5-7 minutes, stirring occasionally.",
      "Add turmeric powder, red chili powder (if using), and salt. Mix well.",
      "Pour in the milk and bring to a gentle simmer. Cook on low heat, stirring continuously, until the milk is absorbed and the mixture thickens (about 10-15 minutes).",
      "Turn off the heat. Squeeze lemon juice and mix in chopped fresh coriander.",
      "Serve hot as a snack or side dish."
    ]
  },
  {
    "id": "aalu049",
    "name": "Aalu Ke Gutke",
    "image": "/images/aalu.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "4-5 medium potatoes, boiled, peeled, and cubed",
      "2 tbsp mustard oil",
      "1 tsp cumin seeds",
      "1/2 tsp fenugreek seeds",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp garam masala",
      "2-3 green chilies, slit",
      "1/4 cup fresh coriander, chopped",
      "Salt to taste"
    ],
    "stateId": "uttarakhand",
    "procedure": [
      "Heat mustard oil in a pan until it smokes lightly, then reduce heat.",
      "Add cumin seeds and fenugreek seeds. Let them splutter.",
      "Add green chilies and sauté for a few seconds.",
      "Add the cubed boiled potatoes. Mix well.",
      "Stir in turmeric powder, red chili powder, coriander powder, garam masala, and salt. Mix gently to coat the potatoes evenly.",
      "Cook on medium heat for 5-7 minutes, stirring occasionally, until the potatoes are lightly roasted and the spices are well combined.",
      "Garnish with fresh coriander and serve hot as a snack or side dish."
    ]
  },
  {
    "id": "rosogolla017",
    "name": "Rosogolla",
    "image": "/images/rosogolla.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 liter full-fat milk",
      "2 tbsp lemon juice or white vinegar (diluted with 2 tbsp water)",
      "2 cups sugar",
      "4 cups water",
      "1/2 tsp cardamom powder (optional)",
      "Few saffron strands (optional)"
    ],
    "stateId": "west-bengal",
    "procedure": [
      "Bring milk to a boil in a heavy-bottomed pan. Once it boils, turn off the heat.",
      "Gradually add diluted lemon juice or vinegar, stirring gently, until the milk curdles completely and the whey separates.",
      "Strain the curdled milk (chhena) through a muslin cloth. Gather the cloth and rinse the chhena under cold water to remove any lemon/vinegar taste.",
      "Squeeze out excess water from the chhena. The chhena should be crumbly but not dry.",
      "Transfer the chhena to a plate and knead it with the heel of your palm for 8-10 minutes until it becomes smooth and free of lumps. This is crucial for soft rosogollas.",
      "Divide the kneaded chhena into small, equal portions and roll them into smooth, crack-free balls.",
      "For sugar syrup: In a large pressure cooker or deep pot, combine sugar and water. Bring to a boil, stirring until sugar dissolves.",
      "Gently drop the chhena balls into the boiling sugar syrup.",
      "If using a pressure cooker, close the lid and cook for 6-7 whistles on high heat. If using a pot, cover and cook for 15-20 minutes on medium-high heat, ensuring the syrup keeps boiling vigorously.",
      "Turn off the heat and let the rosogollas cool completely in the syrup. They will absorb the syrup and become spongy.",
      "Add cardamom powder and saffron strands (if optional).",
      "Serve chilled."
    ]
  },
  {
    "id": "shorshemaach018",
    "name": "Shorshe Maach",
    "image": "/images/shorshemaach.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g fish (Rohu, Katla, or Hilsa preferred), cut into steaks",
      "3 tbsp black mustard seeds, soaked for 30 minutes",
      "1 tbsp yellow mustard seeds, soaked for 30 minutes (optional)",
      "2-3 green chilies (adjust to spice preference)",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder (optional)",
      "2 tbsp mustard oil",
      "1/2 tsp nigella seeds (kalonji)",
      "Salt to taste",
      "Water as needed",
      "Fresh coriander for garnish"
    ],
    "stateId": "west-bengal",
    "procedure": [
      "Marinate fish pieces with a pinch of turmeric and salt for 15 minutes.",
      "Grind soaked black and yellow mustard seeds with green chilies and a little water to a smooth paste. Strain the paste through a fine sieve to remove husks (optional, but makes gravy smoother).",
      "Heat mustard oil in a pan until it smokes lightly, then reduce heat.",
      "Lightly fry the marinated fish pieces until golden on both sides. Remove and set aside.",
      "In the same oil, add nigella seeds. Let them splutter.",
      "Add the mustard-chili paste. Sauté on low heat for 2-3 minutes, stirring continuously, until the raw smell disappears and oil separates.",
      "Add turmeric powder, red chili powder (if using), and salt. Mix well.",
      "Add 1-1.5 cups of water and bring to a boil. Gently place the fried fish pieces into the simmering gravy.",
      "Cover and cook on low heat for 8-10 minutes, or until the fish is cooked through and the gravy thickens slightly.",
      "Garnish with fresh coriander and a drizzle of raw mustard oil (optional).",
      "Serve hot with steamed rice."
    ]
  },
  {
    "id": "masor027",
    "name": "Masor Tenga",
    "image": "/images/masor.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g fish (Rohu, Katla, or any freshwater fish), cut into pieces",
      "2 large tomatoes, chopped",
      "1 small lemon or 1 tbsp tamarind pulp",
      "2-3 green chilies, slit",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder (optional)",
      "1 tbsp mustard oil",
      "1/2 tsp fenugreek seeds",
      "Salt to taste",
      "Water as needed",
      "Fresh coriander for garnish"
    ],
    "stateId": "assam",
    "procedure": [
      "Marinate fish pieces with a pinch of turmeric and salt for 15 minutes.",
      "Heat mustard oil in a pan until it smokes lightly, then reduce heat.",
      "Lightly fry the marinated fish pieces until golden on both sides. Remove and set aside.",
      "In the same oil, add fenugreek seeds. Let them splutter.",
      "Add chopped tomatoes and green chilies. Sauté until tomatoes are soft and mushy.",
      "Add turmeric powder, red chili powder (if using), and salt. Mix well.",
      "Add 2-3 cups of water and bring to a boil. If using tamarind, add the pulp now. If using lemon, add the juice at the end.",
      "Gently place the fried fish pieces into the simmering gravy.",
      "Cover and cook on low heat for 8-10 minutes, or until the fish is cooked through and the gravy thickens slightly.",
      "If using lemon, squeeze the juice into the curry just before serving.",
      "Garnish with fresh coriander and serve hot with steamed rice."
    ]
  },
  {
    "id": "pitha028",
    "name": "Pitha",
    "image": "/images/pitha.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "For the outer layer:",
      "2 cups rice flour",
      "1 cup water",
      "1/2 tsp salt",
      "For the filling:",
      "1 cup grated coconut",
      "1/2 cup jaggery, grated",
      "1/4 tsp cardamom powder"
    ],
    "stateId": "assam",
    "procedure": [
      "For the filling: In a pan, combine grated coconut, grated jaggery, and cardamom powder. Cook on low heat, stirring continuously, until the jaggery melts and the mixture thickens slightly. Let it cool.",
      "For the outer layer: Bring water and salt to a boil in a heavy-bottomed pan. Reduce heat to low. Add rice flour gradually, stirring continuously to avoid lumps, until a dough forms.",
      "Cover and let it rest for 5 minutes. Transfer the dough to a plate and knead it while still warm until smooth and pliable.",
      "Divide the dough into small, equal portions. Flatten each portion into a disc using your palm or a rolling pin.",
      "Place a spoonful of the coconut-jaggery filling in the center of each disc.",
      "Fold the disc in half to form a semi-circle and seal the edges by pressing them together or by making decorative patterns.",
      "Steam the pithas in a steamer for 10-15 minutes, or until cooked through and firm to touch.",
      "Serve warm or at room temperature."
    ]
  },
  {
    "id": "LittiChokha",
    "name": "Litti Chokha",
    "image": "/images/littichokha.jpg",
    "difficulty": "medium",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For Litti:",
      "2 cups wheat flour",
      "1/4 cup ghee or oil",
      "1/2 tsp carom seeds (ajwain)",
      "1/2 tsp baking soda",
      "Salt to taste",
      "Water as needed to knead",
      "For Sattu Filling:",
      "1 cup sattu (roasted gram flour)",
      "1 large onion, finely chopped",
      "2-3 green chilies, finely chopped",
      "1 inch ginger, grated",
      "4-5 cloves garlic, minced",
      "1/4 cup fresh coriander, chopped",
      "1 tbsp mustard oil",
      "1 tbsp lemon juice",
      "1/2 tsp kalonji (nigella seeds)",
      "1/2 tsp carom seeds (ajwain)",
      "Salt to taste",
      "For Chokha:",
      "2 large brinjals (eggplants)",
      "2-3 medium potatoes, boiled and mashed",
      "2 large tomatoes, roasted or boiled",
      "2-3 green chilies, finely chopped",
      "1 inch ginger, grated",
      "4-5 cloves garlic, minced",
      "1/4 cup fresh coriander, chopped",
      "1 tbsp mustard oil",
      "Salt to taste"
    ],
    "stateId": "bihar",
    "procedure": [
      "For Litti Dough: In a bowl, combine wheat flour, ghee/oil, carom seeds, baking soda, and salt. Add water gradually and knead into a stiff dough. Cover and let it rest for 20 minutes.",
      "For Sattu Filling: In a bowl, combine sattu, chopped onion, green chilies, grated ginger, minced garlic, chopped coriander, mustard oil, lemon juice, kalonji, carom seeds, and salt. Mix well. Add a little water if needed to make a crumbly mixture.",
      "For Chokha: Roast brinjals and tomatoes over an open flame or bake until soft. Peel and mash them. Combine with mashed potatoes, chopped green chilies, grated ginger, minced garlic, chopped coriander, mustard oil, and salt. Mix well.",
      "To assemble Litti: Divide the dough into equal portions. Flatten each portion, place a spoonful of sattu filling in the center, and seal the edges to form a ball.",
      "Cook the littis in a traditional Litti Chokha maker, on a gas tandoor, or bake in a preheated oven at 200°C (390°F) until golden brown and cooked through.",
      "Once cooked, dip the hot littis in melted ghee.",
      "Serve hot littis with chokha and green chutney."
    ]
  },
  {
    "id": "Thekuabihar",
    "name": "Thekua",
    "image": "/images/thekua.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "2 cups wheat flour",
      "1 cup jaggery, grated or powdered",
      "1/2 cup ghee, melted",
      "1/4 cup water (or as needed)",
      "1/2 tsp fennel seeds",
      "1/4 tsp cardamom powder (optional)",
      "Oil for deep frying"
    ],
    "stateId": "bihar",
    "procedure": [
      "In a bowl, dissolve jaggery in water. Strain to remove impurities if any.",
      "In a large mixing bowl, combine wheat flour, fennel seeds, and cardamom powder (if using).",
      "Add melted ghee to the flour mixture and rub it in with your fingertips until it resembles breadcrumbs.",
      "Gradually add the jaggery water to the flour mixture and knead into a stiff dough. Do not over-knead.",
      "Take small portions of the dough and press them into desired shapes using a Thekua mould or by hand.",
      "Heat oil in a deep pan over medium-low heat.",
      "Gently slide the Thekuas into the hot oil and fry on low heat until golden brown and crisp on both sides.",
      "Remove with a slotted spoon and drain excess oil on paper towels.",
      "Let them cool completely before storing in an airtight container."
    ]
  },
  {
    "id": "Khajuriabihar",
    "name": "Khajuria",
    "image": "/images/khajuria.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": true,
    "isSpicy": false,
    "ingredients": [
      "1 cup rice flour",
      "1/2 cup jaggery, grated or powdered",
      "1/4 cup water",
      "1/2 tsp fennel seeds",
      "2 tbsp ghee or oil, melted",
      "Oil for deep frying"
    ],
    "stateId": "bihar",
    "procedure": [
      "In a bowl, dissolve jaggery in water. Strain to remove impurities if any.",
      "In a large mixing bowl, combine rice flour and fennel seeds.",
      "Add melted ghee/oil to the flour mixture and rub it in.",
      "Gradually add the jaggery water to the flour mixture and knead into a stiff dough.",
      "Take small portions of the dough and shape them into small, elongated pieces, pressing lightly with your fingers to create a textured surface.",
      "Heat oil in a deep pan over medium-low heat.",
      "Gently slide the Khajurias into the hot oil and fry on low heat until golden brown and crisp.",
      "Remove with a slotted spoon and drain excess oil on paper towels.",
      "Let them cool completely before storing in an airtight container."
    ]
  },
  {
    "id": "Dal",
    "name": "Dal Pitha",
    "image": "/images/dalpitha.jpg",
    "difficulty": "medium",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For the outer layer:",
      "1 cup rice flour",
      "1.5 cups water",
      "1/2 tsp salt",
      "For the filling:",
      "1/2 cup chana dal (split chickpeas), soaked for 2-3 hours",
      "4-5 cloves garlic",
      "2-3 green chilies",
      "1/2 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "1/4 cup fresh coriander, chopped",
      "1 tbsp mustard oil",
      "1/2 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "A pinch of asafoetida (hing)",
      "Salt to taste"
    ],
    "stateId": "bihar",
    "procedure": [
      "For the filling: Drain the soaked chana dal. Grind it coarsely with garlic, green chilies, and cumin seeds. Do not add water.",
      "Heat mustard oil in a pan. Add mustard seeds, cumin seeds, and asafoetida. Let them splutter.",
      "Add the ground dal mixture, turmeric powder, red chili powder, and salt. Cook on low heat, stirring continuously, until the dal is cooked and dry (about 10-15 minutes). Mix in chopped coriander. Let it cool.",
      "For the outer layer: Bring water and salt to a boil in a heavy-bottomed pan. Reduce heat to low. Add rice flour gradually, stirring continuously to avoid lumps, until a dough forms.",
      "Cover and let it rest for 5 minutes. Transfer the dough to a plate and knead it while still warm until smooth and pliable.",
      "Divide the dough into small, equal portions. Flatten each portion into a disc.",
      "Place a spoonful of the dal filling in the center of each disc. Bring the edges together to seal, forming a half-moon shape or a dumpling.",
      "Steam the Dal Pithas in a steamer for 15-20 minutes, or until cooked through and firm to touch.",
      "Serve hot with green chutney or tomato chutney."
    ]
  },
  {
    "id": "KadhiBari",
    "name": "Kadhi Bari",
    "image": "/images/kadhiBari.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "lunch",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For Kadhi:",
      "1 cup sour curd (dahi)",
      "1/4 cup gram flour (besan)",
      "4 cups water",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1 tbsp oil or ghee",
      "1 tsp mustard seeds",
      "1/2 tsp fenugreek seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Few curry leaves",
      "Salt to taste",
      "For Bari (Pakoras):",
      "1 cup gram flour (besan)",
      "1/4 cup finely chopped onion (optional)",
      "1-2 green chilies, finely chopped",
      "1/4 tsp turmeric powder",
      "A pinch of baking soda",
      "Water as needed to make batter",
      "Oil for deep frying"
    ],
    "stateId": "bihar",
    "procedure": [
      "For Bari (Pakoras): In a bowl, combine gram flour, chopped onion (if using), green chilies, turmeric powder, baking soda, and salt. Add water gradually to make a thick pakora batter.",
      "Heat oil for deep frying. Drop small spoonfuls of batter into the hot oil and deep fry until golden brown and crisp. Remove and set aside.",
      "For Kadhi: In a large bowl, whisk together sour curd and gram flour until smooth and lump-free. Gradually add water, whisking continuously, to make a thin, smooth mixture.",
      "Heat oil or ghee in a large pot. Add mustard seeds, fenugreek seeds, dry red chilies, asafoetida, and curry leaves. Let them splutter.",
      "Pour the curd-besan mixture into the pot, stirring continuously to prevent curdling. Add turmeric powder, red chili powder, and salt.",
      "Bring to a boil, then reduce heat to low and simmer for 15-20 minutes, stirring occasionally, until the kadhi thickens and the raw smell of besan disappears.",
      "Add the fried baris (pakoras) to the simmering kadhi and cook for another 5-7 minutes, allowing them to soak up the flavors.",
      "Serve hot with steamed rice."
    ]
  },
  {
    "id": "Balushahi",
    "name": "Balushahi",
    "image": "/images/balushahi.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "dessert",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "2 cups all-purpose flour (maida)",
      "1/2 cup ghee, melted and chilled",
      "1/2 tsp baking soda",
      "1/2 cup cold water (or as needed)",
      "Oil or ghee for deep frying",
      "For Sugar Syrup:",
      "2 cups sugar",
      "1 cup water",
      "1/2 tsp cardamom powder",
      "Few saffron strands (optional)"
    ],
    "stateId": "bihar",
    "procedure": [
      "For the dough: In a large bowl, combine all-purpose flour and baking soda. Mix well.",
      "Add chilled melted ghee to the flour and rub it in with your fingertips until it resembles coarse crumbs.",
      "Gradually add cold water and gently bring the dough together. Do not knead vigorously; just combine until it forms a rough dough. The layers are important for the flaky texture.",
      "Cover the dough with a damp cloth and let it rest for 15-20 minutes.",
      "Divide the dough into equal portions. Take each portion and gently flatten it, then fold it over a few times to create layers. Roll into a ball and flatten slightly, making a small indentation in the center with your thumb.",
      "Heat oil or ghee for deep frying on very low heat. The oil should be warm, not hot.",
      "Gently place the balushahis into the warm oil. Fry on very low heat for 20-25 minutes, flipping occasionally, until they are golden brown and cooked through to the center. This slow frying ensures they cook evenly and become flaky.",
      "Remove from oil and drain excess.",
      "For Sugar Syrup: In a saucepan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency. Add cardamom powder and saffron strands (if using).",
      "Dip the warm balushahis into the warm sugar syrup for 5-7 minutes, ensuring they are well coated and absorb the syrup.",
      "Remove from syrup and let them cool on a wire rack. They will crystallize slightly as they cool.",
      "Serve at room temperature."
    ]
  },
  {
    "id": "ChanaSattuDrink",
    "name": "Chana Sattu Drink",
    "image": "/images/chanaSattu.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "beverage",
    "isInstant": true,
    "isSpicy": false,
    "ingredients": [
      "2 tbsp sattu (roasted gram flour)",
      "1 glass cold water",
      "Juice of 1/2 lemon",
      "1/4 tsp black salt (kala namak)",
      "1/4 tsp roasted cumin powder",
      "A pinch of regular salt",
      "Finely chopped green chili (optional)",
      "Finely chopped onion (optional)",
      "Fresh mint leaves for garnish (optional)"
    ],
    "stateId": "bihar",
    "procedure": [
      "In a glass, combine sattu, black salt, roasted cumin powder, and regular salt.",
      "Add a little cold water and mix well to form a smooth paste, ensuring no lumps.",
      "Gradually add the remaining cold water, stirring continuously, until the sattu is fully dissolved and the drink is smooth.",
      "Add lemon juice and mix well.",
      "If desired, add finely chopped green chili and onion for a savory version.",
      "Garnish with fresh mint leaves (optional) and serve immediately."
    ]
  },
  {
    "id": "MalpuaBihar",
    "name": "Malpua",
    "image": "/images/malpua.jpg",
    "difficulty": "medium",
    "isVeg": true,
    "type": "dessert",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup all-purpose flour (maida)",
      "1/4 cup semolina (sooji)",
      "1/2 cup milk (or as needed)",
      "1/4 cup sugar (for batter, adjust to taste)",
      "1/2 tsp fennel seeds",
      "1/4 tsp cardamom powder",
      "A pinch of baking soda (optional)",
      "Ghee or oil for frying",
      "For Sugar Syrup:",
      "1 cup sugar",
      "1/2 cup water",
      "1/4 tsp cardamom powder",
      "Few saffron strands (optional)"
    ],
    "stateId": "bihar",
    "procedure": [
      "For the batter: In a bowl, combine all-purpose flour, semolina, sugar, fennel seeds, cardamom powder, and baking soda (if using).",
      "Gradually add milk, whisking continuously, to make a smooth, thick batter without lumps. The consistency should be pourable but not too thin.",
      "Cover the batter and let it rest for 30 minutes to 1 hour.",
      "For Sugar Syrup: In a saucepan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency. Add cardamom powder and saffron strands (if using). Keep warm.",
      "Heat ghee or oil in a shallow pan or kadai over medium-low heat.",
      "Pour a ladleful of batter into the hot ghee/oil to form a small, round malpua. Do not overcrowd the pan.",
      "Fry on low to medium heat until golden brown and crisp on both sides. Remove and drain excess ghee/oil.",
      "Immediately dip the hot malpuas into the warm sugar syrup for 2-3 minutes, ensuring they are well coated.",
      "Remove from syrup and serve warm, optionally garnished with chopped nuts or rabri."
    ]
  },
  {
    "id": "Ghugnibihar",
    "name": "Ghugni",
    "image": "/images/ghugni.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup dried yellow peas (matar), soaked overnight",
      "1 large onion, finely chopped",
      "1 large tomato, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "1/2 tsp garam masala",
      "2 tbsp mustard oil",
      "1/2 tsp cumin seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Fresh coriander for garnish",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "bihar",
    "procedure": [
      "Drain the soaked yellow peas. Pressure cook with 2-3 cups of water and a pinch of salt for 4-5 whistles until soft but not mushy.",
      "Heat mustard oil in a pan. Add cumin seeds and dry red chilies. Let them splutter.",
      "Add chopped onion and sauté until golden brown. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add chopped tomato and cook until soft and mushy.",
      "Stir in cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Cook for 2-3 minutes.",
      "Add the cooked yellow peas along with their cooking water. Bring to a boil, then reduce heat and simmer for 10-15 minutes, allowing the flavors to meld and the gravy to thicken slightly.",
      "Add garam masala and mix well.",
      "Garnish with fresh coriander and serve hot with chopped onions, green chilies, and a squeeze of lemon juice."
    ]
  },
  {
    "id": "parwalKiMithai",
    "name": "Parwal Ki Mithai",
    "image": "/images/parwalKiMithai.jpg",
    "difficulty": "hard",
    "isVeg": true,
    "type": "dessert",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "500g parwal (pointed gourd)",
      "2 cups sugar",
      "2 cups water",
      "1/2 tsp cardamom powder",
      "For the filling:",
      "1 cup khoya (mawa), grated",
      "1/4 cup powdered sugar",
      "1/4 tsp cardamom powder",
      "Chopped dry fruits (pistachios, almonds) for garnish"
    ],
    "stateId": "bihar",
    "procedure": [
      "Peel the parwal lightly, leaving some green skin. Slit them lengthwise from one side, making sure not to cut through completely. Remove the seeds carefully.",
      "Blanch the parwal in boiling water for 5-7 minutes until slightly tender but still firm. Drain and immediately plunge into ice-cold water to retain color.",
      "For sugar syrup: In a wide pan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency.",
      "Add the blanched parwal to the sugar syrup. Cook on low heat for 15-20 minutes, or until the parwal becomes translucent and absorbs the syrup. Add cardamom powder. Turn off heat and let the parwal soak in the syrup for at least 2-3 hours, or overnight.",
      "For the filling: In a bowl, combine grated khoya, powdered sugar, and cardamom powder. Mix well.",
      "Drain the parwal from the sugar syrup. Gently squeeze out excess syrup.",
      "Stuff each parwal with the khoya filling.",
      "Garnish with chopped dry fruits.",
      "Serve chilled."
    ]
  },
  {
    "id": "mokthuk050",
    "name": "Mokthuk",
    "image": "/images/mokthuk.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "200g fresh noodles or pasta",
      "2 cups mixed vegetables (e.g., cabbage, carrots, beans, mushrooms), thinly sliced",
      "1 large onion, sliced",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder (optional)",
      "1 tbsp oil",
      "4-5 cups vegetable broth or water",
      "Salt to taste",
      "Fresh coriander or spring onions for garnish"
    ],
    "stateId": "arunachal-pradesh",
    "procedure": [
      "Cook noodles according to package instructions. Drain and set aside.",
      "Heat oil in a large pot or wok.",
      "Add sliced onion and sauté until translucent. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add all the mixed vegetables and sauté for 5-7 minutes until slightly tender-crisp.",
      "Stir in turmeric powder, red chili powder (if optional), and salt.",
      "Pour in vegetable broth or water. Bring to a boil, then reduce heat and simmer for 5-7 minutes, allowing the flavors to combine.",
      "Add the cooked noodles to the soup and mix gently.",
      "Cook for another 2-3 minutes until the noodles are heated through.",
      "Garnish with fresh coriander or chopped spring onions and serve hot."
    ]
  },
  {
    "id": "dhokla013",
    "name": "Dhokla",
    "image": "/images/dhokla.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "snack",
    "isInstant": true,
    "isSpicy": false,
    "ingredients": [
      "1 cup gram flour (besan)",
      "1/4 cup semolina (sooji)",
      "1 cup sour curd (dahi)",
      "1/2 tsp ginger-green chili paste",
      "1/4 tsp turmeric powder",
      "1 tsp fruit salt (Eno) or 1/2 tsp baking soda + 1 tsp lemon juice",
      "Water as needed",
      "Salt to taste",
      "For tempering:",
      "1 tbsp oil",
      "1 tsp mustard seeds",
      "Few curry leaves",
      "2-3 green chilies, slit",
      "1 tbsp sugar",
      "1/4 cup water",
      "Fresh coriander for garnish"
    ],
    "stateId": "gujarat",
    "procedure": [
      "In a large bowl, combine gram flour, semolina, sour curd, ginger-green chili paste, turmeric powder, and salt. Gradually add water, whisking continuously, to make a smooth, thick batter without lumps.",
      "Cover the batter and let it rest for 15-20 minutes.",
      "Grease a steaming plate or pan with oil.",
      "Just before steaming, add fruit salt (Eno) or baking soda + lemon juice to the batter. Mix gently in one direction until frothy. Do not overmix.",
      "Immediately pour the batter into the greased plate and steam in a steamer for 15-20 minutes, or until a knife inserted comes out clean.",
      "Remove from steamer and let it cool slightly. Cut into squares.",
      "For tempering: Heat oil in a small pan. Add mustard seeds, curry leaves, and green chilies. Let them splutter.",
      "Add sugar and water. Bring to a boil and simmer until sugar dissolves.",
      "Pour the hot tempering evenly over the steamed dhokla pieces.",
      "Garnish with fresh coriander and serve."
    ]
  },
  {
    "id": "khandvi014",
    "name": "Khandvi",
    "image": "/images/khandvi.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup gram flour (besan)",
      "1 cup sour yogurt (dahi), whisked",
      "2 cups water",
      "1/2 tsp ginger-green chili paste",
      "1/4 tsp turmeric powder",
      "A pinch of asafoetida (hing)",
      "Salt to taste",
      "For tempering:",
      "1 tbsp oil",
      "1 tsp mustard seeds",
      "Few curry leaves",
      "2-3 green chilies, slit",
      "1 tbsp grated coconut (for garnish)",
      "Fresh coriander for garnish"
    ],
    "stateId": "gujarat",
    "procedure": [
      "In a large bowl, combine gram flour, whisked sour yogurt, water, ginger-green chili paste, turmeric powder, asafoetida, and salt. Whisk well to form a smooth, lump-free batter.",
      "Heat a large, non-stick pan on low heat. Pour the batter into the pan and cook on low heat, stirring continuously with a whisk or spatula, to prevent lumps.",
      "Continue stirring for 10-15 minutes until the batter thickens considerably and starts leaving the sides of the pan. It should be thick enough to spread.",
      "Immediately spread a thin layer of the hot batter evenly onto the back of greased plates or a clean kitchen counter using a spatula.",
      "Let it cool for 5-7 minutes until it sets.",
      "Once set, cut into 1-inch wide strips and gently roll each strip into a tight cylinder.",
      "Arrange the rolled khandvis on a serving plate.",
      "For tempering: Heat oil in a small pan. Add mustard seeds, curry leaves, and green chilies. Let them splutter.",
      "Pour the hot tempering evenly over the khandvis.",
      "Garnish with grated coconut and fresh coriander.",
      "Serve immediately."
    ]
  },
  {
    "id": "phagshapa056",
    "name": "Phagshapa",
    "image": "/images/phagshapa.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g pork, cut into pieces",
      "2-3 large radishes, peeled and sliced",
      "4-5 dry red chilies, broken",
      "1 large onion, sliced",
      "1 inch ginger, julienned",
      "2-3 cloves garlic, minced",
      "1/2 tsp turmeric powder",
      "1 tbsp oil",
      "Water as needed",
      "Salt to taste"
    ],
    "stateId": "sikkim",
    "procedure": [
      "Heat oil in a pot or pressure cooker.",
      "Add sliced onion and sauté until translucent. Add julienned ginger and minced garlic, sauté for a minute.",
      "Add pork pieces and sear on all sides until browned.",
      "Stir in turmeric powder, broken dry red chilies, and salt. Cook for 2-3 minutes.",
      "Add sliced radishes and mix well.",
      "Add 1-1.5 cups of water, bring to a boil, then cover and simmer until the pork is tender and radishes are cooked (about 30-40 minutes in a pot, 15-20 minutes in a pressure cooker after the first whistle).",
      "Adjust seasoning and serve hot with steamed rice."
    ]
  },
  {
    "id": "bajra029",
    "name": "Bajra Khichdi",
    "image": "/images/bajra.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup bajra (pearl millet), soaked overnight",
      "1/2 cup moong dal (split green gram), soaked for 30 minutes",
      "1 large onion, finely chopped",
      "1 tomato, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, slit",
      "1/2 tsp turmeric powder",
      "1 tsp red chili powder",
      "1 tsp coriander powder",
      "1/2 tsp garam masala",
      "2 tbsp ghee",
      "1 tsp cumin seeds",
      "A pinch of asafoetida (hing)",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "haryana",
    "procedure": [
      "Drain the soaked bajra and moong dal.",
      "In a pressure cooker, heat ghee. Add cumin seeds and asafoetida. Let them splutter.",
      "Add chopped onion and sauté until golden brown. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add chopped tomato and cook until soft and mushy.",
      "Stir in turmeric powder, red chili powder, coriander powder, and salt. Cook for 2-3 minutes.",
      "Add the soaked bajra and moong dal. Mix well.",
      "Add 4-5 cups of water. Bring to a boil, then close the pressure cooker lid. Cook for 5-6 whistles on medium heat, or until the bajra is soft and well cooked.",
      "Once the pressure releases, mash the khichdi lightly with a ladle.",
      "Add garam masala and mix well.",
      "Garnish with fresh coriander and serve hot with curd, pickle, or ghee."
    ]
  },
  {
    "id": "besan030",
    "name": "Besan Masala Roti",
    "image": "/images/besanroti.jpg",
    "difficulty": "easy",
    "isVeg": true,
    "type": "breakfast",
    "isInstant": true,
    "isSpicy": true,
    "ingredients": [
      "1 cup gram flour (besan)",
      "1 cup wheat flour (atta)",
      "1/2 cup finely chopped onion",
      "2-3 green chilies, finely chopped",
      "1/4 cup fresh coriander, chopped",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp red chili powder",
      "1/2 tsp carom seeds (ajwain)",
      "2 tbsp oil or ghee",
      "Water as needed to knead",
      "Salt to taste"
    ],
    "stateId": "haryana",
    "procedure": [
      "In a large bowl, combine gram flour, wheat flour, chopped onion, green chilies, chopped coriander, cumin powder, coriander powder, red chili powder, carom seeds, and salt.",
      "Add 1 tbsp oil or ghee to the flour mixture and mix well.",
      "Gradually add water and knead into a soft, pliable dough. Cover and let it rest for 10-15 minutes.",
      "Divide the dough into equal portions and roll them into thin rotis (flatbreads).",
      "Heat a tawa (griddle) on medium heat. Cook each roti on both sides, applying a little oil or ghee, until golden brown spots appear.",
      "Serve hot with curd, pickle, or chutney."
    ]
  },
  {
    "id": "bisi023",
    "name": "Bisi Bele Bath",
    "image": "/images/bisi.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1/2 cup rice",
      "1/4 cup toor dal (split pigeon peas)",
      "2 cups mixed vegetables (e.g., carrots, beans, peas, potato, brinjal), chopped",
      "1 small lemon-sized ball of tamarind, soaked in warm water",
      "2 tbsp Bisi Bele Bath powder",
      "1/2 tsp turmeric powder",
      "1 tbsp ghee",
      "1 tsp mustard seeds",
      "1/2 tsp cumin seeds",
      "2-3 dry red chilies",
      "A pinch of asafoetida (hing)",
      "Few curry leaves",
      "1/4 cup roasted peanuts (optional)",
      "Fresh coriander for garnish",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "karnataka",
    "procedure": [
      "Wash rice and toor dal thoroughly. Pressure cook them together with 3 cups of water and turmeric powder for 4-5 whistles until soft. Mash lightly and set aside.",
      "Extract tamarind pulp from the soaked tamarind.",
      "In a large pot, combine chopped mixed vegetables and 1 cup of water. Cook until the vegetables are half done.",
      "Add the tamarind pulp, Bisi Bele Bath powder, and salt to the vegetables. Cook for 5-7 minutes until the raw smell of the powder disappears.",
      "Add the cooked rice and dal mixture to the vegetables. Add more water if needed to adjust consistency. Bring to a boil and simmer for 10-15 minutes, allowing flavors to meld.",
      "For tempering: Heat ghee in a small pan. Add mustard seeds, cumin seeds, dry red chilies, asafoetida, and curry leaves. Let them splutter.",
      "Pour the tempering over the simmering Bisi Bele Bath. Add roasted peanuts (if using) and mix well.",
      "Garnish with fresh coriander and serve hot with boondi or potato chips."
    ]
  },
  {
    "id": "mysorepak024",
    "name": "Mysore Pak",
    "image": "/images/mysorepak.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "sweet",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup gram flour (besan)",
      "1.5 cups ghee, melted",
      "1.5 cups sugar",
      "1/2 cup water"
    ],
    "stateId": "karnataka",
    "procedure": [
      "Grease a baking tray or a flat plate with ghee and keep it ready.",
      "In a large bowl, mix gram flour with 1/4 cup of melted ghee to form a smooth, lump-free paste. Set aside.",
      "In a heavy-bottomed pan, combine sugar and water. Bring to a boil and simmer until it reaches a one-string consistency.",
      "Reduce heat to low. Gradually add the gram flour-ghee paste to the sugar syrup, stirring continuously to avoid lumps. Keep stirring until the mixture thickens.",
      "Now, gradually add the remaining melted ghee, a tablespoon at a time, stirring continuously. The mixture will absorb the ghee and become frothy. Continue adding ghee and stirring until the mixture starts leaving the sides of the pan and becomes porous.",
      "Once the mixture is well cooked and has a porous texture, immediately pour it into the greased tray.",
      "Gently spread it evenly. Do not press too much. Let it cool for 5-10 minutes.",
      "While still warm, cut into desired shapes (squares or rectangles). Let it cool completely before serving.",
      "Store in an airtight container."
    ]
  },
  {
    "id": "roganjosh049",
    "name": "Rogan Josh",
    "image": "/images/roganjosh.jpg",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g mutton, cut into pieces",
      "1 cup plain yogurt, whisked",
      "2 large onions, finely chopped",
      "1 tbsp ginger-garlic paste",
      "1 tsp red chili powder (Kashmiri chili powder for color)",
      "1 tsp fennel powder (saunf powder)",
      "1 tsp dry ginger powder (saunth powder)",
      "1/2 tsp garam masala",
      "Whole spices (cinnamon stick, cardamom pods, cloves, bay leaves)",
      "2 tbsp oil or ghee",
      "Water as needed",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "jammu-kashmir",
    "procedure": [
      "Heat oil or ghee in a heavy-bottomed pot or pressure cooker.",
      "Add whole spices and let them splutter. Add chopped onions and sauté until golden brown.",
      "Add ginger-garlic paste and sauté for a minute.",
      "Add mutton pieces and sear on all sides until browned.",
      "Reduce heat to low. Gradually add whisked yogurt, stirring continuously to prevent curdling. Cook until the yogurt is well incorporated and oil separates.",
      "Stir in red chili powder, fennel powder, dry ginger powder, garam masala, and salt. Cook for 2-3 minutes.",
      "Add 1-1.5 cups of water. Bring to a boil, then cover and simmer until the mutton is tender (about 45-60 minutes in a pot, 20-25 minutes in a pressure cooker after the first whistle).",
      "Adjust seasoning and consistency of the gravy.",
      "Garnish with fresh coriander and serve hot with rice or naan."
    ]
  },
  {
    "id": "eromba051",
    "name": "Eromba",
    "image": "/images/eromba.jpg",
    "difficulty": "moderate",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "100g fermented fish (ngari), roasted or fried",
      "2 cups mixed vegetables (e.g., potato, brinjal, beans, cabbage), boiled and mashed",
      "4-5 green chilies, roasted or boiled and mashed",
      "1 large onion, finely chopped",
      "1/4 cup fresh coriander, chopped",
      "Salt to taste"
    ],
    "stateId": "manipur",
    "procedure": [
      "If using raw fermented fish, roast it over an open flame or fry lightly until fragrant. Break it into smaller pieces.",
      "Boil mixed vegetables until very soft. Drain and mash them coarsely.",
      "Roast or boil green chilies until soft, then mash them.",
      "In a large bowl, combine mashed vegetables, mashed green chilies, roasted/fried fermented fish, finely chopped onion, and chopped fresh coriander.",
      "Mix everything thoroughly with your hands, mashing and combining the ingredients well.",
      "Add salt to taste (fermented fish is salty, so add carefully).",
      "Serve at room temperature with steamed rice."
    ]
  },
  {
    "id": "appam009",
    "name": "Appam",
    "image": "/images/appam.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "breakfast",
    "isInstant": false,
    "isSpicy": false,
    "ingredients": [
      "1 cup raw rice, soaked overnight",
      "1/4 cup cooked rice",
      "1/4 cup grated coconut",
      "1/2 tsp dry yeast",
      "1 tsp sugar",
      "1/4 cup lukewarm water",
      "Salt to taste"
    ],
    "stateId": "kerala",
    "procedure": [
      "In a small bowl, dissolve yeast and sugar in lukewarm water. Let it sit for 5-10 minutes until frothy.",
      "Drain the soaked raw rice. Grind it along with cooked rice and grated coconut to a very smooth batter using minimal water.",
      "Transfer the batter to a large bowl. Add the activated yeast mixture and salt. Mix well.",
      "Cover the bowl and let it ferment in a warm place for 8-12 hours, or until the batter doubles in volume and becomes frothy.",
      "Heat an appam pan (appachatti) on medium heat. Grease lightly with oil.",
      "Pour a ladleful of batter into the center of the pan. Immediately swirl the pan to spread the batter thinly around the edges, leaving a thicker center.",
      "Cover and cook for 2-3 minutes, or until the edges are crisp and golden, and the center is soft and spongy.",
      "Remove from pan and serve hot with vegetable stew or coconut milk."
    ]
  },
  {
    "id": "fishcurry010",
    "name": "Kerala Fish Curry",
    "image": "/images/fishcurry.jpg",
    "difficulty": "hard",
    "isVeg": false,
    "type": "dinner",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "500g fish (Kingfish, Mackerel, or Sardines preferred), cut into pieces",
      "1 cup coconut milk (thick)",
      "1/2 cup coconut milk (thin)",
      "1 large onion, sliced",
      "1 tbsp ginger, finely chopped",
      "1 tbsp garlic, finely chopped",
      "4-5 green chilies, slit",
      "Few curry leaves",
      "1/2 tsp turmeric powder",
      "1 tbsp red chili powder (Kashmiri for color, regular for spice)",
      "1 tbsp coriander powder",
      "1/2 tsp fenugreek seeds",
      "2-3 kokum pieces (Malabar tamarind), soaked in warm water (or 1 tbsp tamarind pulp)",
      "2 tbsp coconut oil",
      "Salt to taste",
      "Fresh coriander for garnish"
    ],
    "stateId": "kerala",
    "procedure": [
      "Marinate fish pieces with a pinch of turmeric and salt for 15 minutes.",
      "Heat coconut oil in a clay pot (chatti) or heavy-bottomed pan.",
      "Add fenugreek seeds. Let them splutter.",
      "Add sliced onion, chopped ginger, chopped garlic, and green chilies. Sauté until onions are translucent.",
      "Add curry leaves and sauté for a minute.",
      "Reduce heat to low. Add turmeric powder, red chili powder, and coriander powder. Sauté for a minute until fragrant.",
      "Add thin coconut milk and soaked kokum pieces (or tamarind pulp). Bring to a boil.",
      "Gently place the marinated fish pieces into the simmering gravy. Cover and cook on low heat for 10-12 minutes, or until the fish is cooked through.",
      "Add thick coconut milk and simmer for another 5 minutes. Do not boil after adding thick coconut milk.",
      "Adjust salt to taste.",
      "Garnish with fresh coriander and serve hot with rice or appam."
    ]
  },
  {
    "id": "chana035",
    "name": "Chana Samosa",
    "image": "/images/chanasamosa.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "For the Samosa Dough:",
      "2 cups all-purpose flour (maida)",
      "1/4 cup ghee or oil",
      "1/2 tsp carom seeds (ajwain)",
      "1/2 tsp salt",
      "Water as needed to knead",
      "For the Chana Filling:",
      "1 cup chana dal (split chickpeas), soaked for 2-3 hours",
      "1 large onion, finely chopped",
      "1 tbsp ginger-garlic paste",
      "2-3 green chilies, finely chopped",
      "1 tsp cumin powder",
      "1 tsp coriander powder",
      "1/2 tsp turmeric powder",
      "1/2 tsp red chili powder",
      "1/2 tsp garam masala",
      "1/4 cup fresh coriander, chopped",
      "2 tbsp oil",
      "1/2 tsp cumin seeds",
      "Salt to taste",
      "Oil for deep frying"
    ],
    "stateId": "chhattisgarh",
    "procedure": [
      "For Samosa Dough: In a bowl, combine all-purpose flour, ghee/oil, carom seeds, and salt. Rub the ghee into the flour until it resembles breadcrumbs.",
      "Gradually add water and knead into a stiff dough. Cover and let it rest for 30 minutes.",
      "For Chana Filling: Drain the soaked chana dal. Pressure cook with 1 cup of water for 2 whistles until soft but not mushy. Drain excess water.",
      "Heat oil in a pan. Add cumin seeds. Let them splutter.",
      "Add chopped onion and sauté until translucent. Add ginger-garlic paste and green chilies, sauté for a minute.",
      "Add the cooked chana dal, cumin powder, coriander powder, turmeric powder, red chili powder, garam masala, and salt. Mix well and cook on low heat for 5-7 minutes, mashing some dal lightly, until the mixture is dry.",
      "Mix in chopped fresh coriander. Let the filling cool completely.",
      "To assemble Samosas: Divide the dough into equal portions. Roll each portion into an oval shape.",
      "Cut the oval in half to form two semi-circles. Take one semi-circle, apply water along the straight edge, and form a cone.",
      "Fill the cone with the chana filling. Seal the open edge firmly to form a samosa.",
      "Heat oil for deep frying on low heat. Gently place the samosas in the warm oil. Fry on low heat for 15-20 minutes, flipping occasionally, until golden brown and crisp.",
      "Remove and drain excess oil on paper towels.",
      "Serve hot with chutney."
    ]
  },
  {
    "id": "faraa036",
    "name": "Faraa",
    "image": "/images/faraa.jpg",
    "difficulty": "moderate",
    "isVeg": true,
    "type": "snack",
    "isInstant": false,
    "isSpicy": true,
    "ingredients": [
      "1 cup rice flour",
      "1/2 cup chana dal (split chickpeas), soaked for 2-3 hours",
      "1/4 cup urad dal (split black gram), soaked for 2-3 hours",
      "2-3 green chilies",
      "1 inch ginger",
      "4-5 cloves garlic",
      "1/2 tsp cumin seeds",
      "1/2 tsp turmeric powder",
      "1/4 cup fresh coriander, chopped",
      "1 tbsp oil",
      "1 tsp mustard seeds",
      "Few curry leaves",
      "A pinch of asafoetida (hing)",
      "Salt to taste",
      "Water as needed"
    ],
    "stateId": "chhattisgarh",
    "procedure": [
      "Drain the soaked chana dal and urad dal. Grind them coarsely with green chilies, ginger, garlic, and cumin seeds. Do not add water.",
      "In a bowl, combine the ground dal mixture, turmeric powder, chopped coriander, and salt. Mix well.",
      "For the outer layer: Bring 1.5 cups of water and a pinch of salt to a boil in a heavy-bottomed pan. Reduce heat to low. Add rice flour gradually, stirring continuously to avoid lumps, until a dough forms.",
      "Cover and let it rest for 5 minutes. Transfer the dough to a plate and knead it while still warm until smooth and pliable.",
      "Divide the dough into small, equal portions. Flatten each portion into a disc.",
      "Place a spoonful of the dal filling in the center of each disc. Bring the edges together to seal, forming a half-moon shape or a dumpling.",
      "Steam the Faraas in a steamer for 15-20 minutes, or until cooked through and firm to touch.",
      "For tempering: Heat oil in a pan. Add mustard seeds, curry leaves, and asafoetida. Let them splutter.",
      "Add the steamed Faraas to the tempering and toss gently to coat.",
      "Serve hot with green chutney or tomato chutney."
    ]
  }
]
